let arrLang = {
    'ua': {
        'services': 'Послуги',
        'benefits': 'Переваги',
        'aboutUs': 'Про\nнас',
        'contacts': 'Контакти',
        'address': 'м. Київ, вул. Ярослава Івашкевича, 4',
        'slogan-text': 'Майстерня ключів  на будь-який  смак та колір',
        'header-services1': 'Виготовлення дубліката квартирних ключів всіх видів',
        'header-services2': 'Виготовлення дубліката автомобільних ключів',
        'header-services3': 'Заміна корпусів (пульта) автомобільних ключів',
        'header-services4': 'Виготовлення (програмування) пультів',
        'header-services5': 'Виготовлення дубліката ключа по замку',
        'header-services6': 'Ремонт замків (заміна секретів на нові)',
        'header-services7': 'Перекодування замка',
        'titleServices': 'Послуги',

    },
    'ru': {
        'services': 'Услуги',
        'benefits': 'Преимущества',
        'aboutUs': 'О нас',
        'contacts': 'Контакты',
        'address': 'г. Киев, ул. Ярослава Ивашкевича, 4',
        'slogan-text': 'Мастерская ключей на любой вкус и цвет',
        'header-services1': 'Изготовление дубликата квартирных ключей всех видов',
        'header-services2': 'Изготовление дубликата автомобильных ключей',
        'header-services3': 'Замена корпусов (пульта) автомобильных ключей',
        'header-services4': 'Изготовление (программирование) пультов',
        'header-services5': 'Изготовление дубликата ключа по замку',
        'header-services6': 'Ремонт замков (замена секретов на новые)',
        'header-services7': 'Перекодировка замка',
        'titleServices': 'Услуги',
        'title-service1': 'Изготовление дубликата квартирных ключей всех видов',
        'title-service2': 'Изготовление дубликата автомобильных ключей',
        'title-service3': 'Замена корпусов (пульта) автомобильных ключей',
        'title-service4': 'Изготовление (программирование) пультов для ворот или шлагбаумов',
        'title-service5': 'Изготовление дубликата ключа по замку (при потере или поломке ключа) ',
        'title-service6': 'Ремонт замков (замена секретов на новые)',
        'title-service7': 'Перекодировка замка',
        'text-service1': 'Равным образом, выбранный нами инновационный путь, а также свежий взгляд на\n' +
            '                    привычные вещи - безусловно открывает новые горизонты для инновационных методов управления\n' +
            '                    процессами.\n' +
            '                    С учётом сложившейся международной обстановки, высококачественный прототип будущего проекта требует\n' +
            '                    анализа.',
        'text-service2': 'Равным образом, выбранный нами инновационный путь, а также свежий взгляд на\n' +
            '                    привычные вещи - безусловно открывает новые горизонты для инновационных методов управления процессами.\n' +
            '                    С учётом сложившейся международной обстановки, высококачественный прототип будущего проекта требует\n' +
            '                    анализа благоприятных перспектив. Лишь ключевые особенности структуры проекта, инициированные исключительно\n' +
            '                    синтетически, объективно рассмотрены соответствующими инстанциями.',
        'text-service3': 'Равным образом, выбранный нами инновационный путь, а также свежий взгляд на\n' +
            '                    привычные вещи - безусловно открывает новые горизонты для инновационных методов управления процессами.\n' +
            '                    С учётом сложившейся международной обстановки, высококачественный прототип будущего проекта требует анализа\n' +
            '                    благоприятных перспектив. Лишь ключевые особенности структуры проекта, инициированные исключительно синтетически,\n' +
            '                    объективно рассмотрены соответствующими инстанциями.',
        'text-service4': 'Равным образом, выбранный нами инновационный путь, а также свежий взгляд на\n' +
            '                    привычные вещи - безусловно открывает новые горизонты для инновационных методов управления процессами.\n' +
            '                    С учётом сложившейся международной обстановки, высококачественный прототип будущего проекта требует анализа\n' +
            '                    благоприятных перспектив. Лишь ключевые особенности структуры проекта, инициированные исключительно синтетически,\n' +
            '                    объективно рассмотрены соответствующими инстанциями.',
        'text-service5': 'Равным образом, выбранный нами инновационный путь, а также свежий взгляд на\n' +
            '                    привычные вещи - безусловно открывает новые горизонты для инновационных методов управления процессами.\n' +
            '                    С учётом сложившейся международной обстановки, высококачественный прототип будущего проекта требует анализа\n' +
            '                    благоприятных перспектив. Лишь ключевые особенности структуры проекта, инициированные исключительно синтетически,\n' +
            '                    объективно рассмотрены соответствующими инстанциями.',
        'text-service6': 'Равным образом, выбранный нами инновационный путь, а также свежий взгляд на\n' +
            '                    привычные вещи - безусловно открывает новые горизонты для инновационных методов управления процессами.\n' +
            '                    С учётом сложившейся международной обстановки, высококачественный прототип будущего проекта требует\n' +
            '                    анализа благоприятных перспектив. Лишь ключевые особенности структуры проекта, инициированные исключительно\n' +
            '                    синтетически, объективно рассмотрены соответствующими инстанциями.',
        'text-service7': 'Равным образом, выбранный нами инновационный путь, а также свежий взгляд на\n' +
            '                    привычные вещи - безусловно открывает новые горизонты для инновационных методов управления процессами.\n' +
            '                    С учётом сложившейся международной обстановки, высококачественный прототип будущего проекта требует\n' +
            '                    анализа благоприятных перспектив. Лишь ключевые особенности структуры проекта, инициированные\n' +
            '                    исключительно синтетически, объективно рассмотрены соответствующими инстанциями.',


    }
}
//перевод текста
$(function () {
    $('.translate').click(function () {
        let lang = $(this).attr('id');
        $('.lang').each(function (index, item) {
            $(this).text(arrLang[lang][$(this).attr('key')]);
        })
    })
})

// BURGER MENU
let burger = document.querySelector('.header-top__burger');
let mobMenu = document.querySelector('.mobile-menu');
// let menuLink = document.querySelectorAll('.header-top__link');
console.log(burger);

function activeBurger() {
    burger.classList.toggle('active');
    mobMenu.classList.toggle('active');
}

burger.addEventListener("click", activeBurger);

// маска для формы
$(function($){
    $("#form-phone").mask("+38(999) 999-9999");
});

// Якорное Меню
function anchorMenu(event) {
    event.preventDefault();
    let id = $(this).attr('href'),
        top = $(id).offset().top;
    $('body,html').animate({
        scrollTop: top
    }, 1000);
};
$(".anchor").on("click", "a", anchorMenu);

// POP UP
let popup = document.querySelector('.pop-up');
let closePopUp = document.querySelector('.close-popUp');
let btn = document.querySelectorAll('.btn');
let formPopUp = document.querySelector('.call-back__container');

btn.forEach( item => {
    item.onclick = function () {
        popup.classList.add('open');
    }
})

closePopUp.addEventListener("click", function () {
    popup.classList.remove('open');
})

popup.onclick = function(e){
    let target = e.target;
    if (target.closest('div') != formPopUp){
        popup.classList.remove('open');
    }
}

// скролл в верх
let scrollUp = document.querySelector('.scroll-up');
function showScrollUp(){
    let heightSite = Math.max(
        document.body.scrollHeight, document.documentElement.scrollHeight,
        document.body.offsetHeight, document.documentElement.offsetHeight,
        document.body.clientHeight, document.documentElement.clientHeight
    );
    let heightScroll = window.pageYOffset;
    console.log(heightScroll);

    if (heightScroll > heightSite/5){
        scrollUp.hidden = false;
    }else {
        scrollUp.hidden = true;
    }
}
window.addEventListener("scroll", showScrollUp);
scrollUp.onclick = function () {
    scrollTo(0,0);
}


